Revit 2024 API
BuiltInFailures.MassFailures.AutoGlazingFailed Property
 Failure in Auto-Glazing region computation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AutoGlazingFailed { get; }
Visual Basic
Public Shared ReadOnly Property AutoGlazingFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AutoGlazingFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace